In [126]:
import pandas as pd
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score
from sklearn.model_selection import RandomizedSearchCV,GridSearchCV
from sklearn.model_selection import train_test_split

In [44]:
train = pd.read_csv('/Users/artemarhipov/Downloads/titanic/train.csv')

In [45]:
test = pd.read_csv('/Users/artemarhipov/Downloads/titanic/test.csv')

In [46]:
test.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [47]:
test = test.drop(['Cabin', 'Name', 'Ticket'],axis = 1)
test = pd.get_dummies(test)

In [48]:
test.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,892,3,34.5,0,0,7.8292,0,1,0,1,0
1,893,3,47.0,1,0,7.0000,1,0,0,0,1
2,894,2,62.0,0,0,9.6875,0,1,0,1,0
3,895,3,27.0,0,0,8.6625,0,1,0,0,1
4,896,3,22.0,1,1,12.2875,1,0,0,0,1

In [49]:
test.Age = test.Age.fillna(test.Age.mean())
test.Fare = test.Fare.fillna(test.Fare.mean())

In [50]:
X_test = test.drop(['PassengerId'],axis = 1)

In [51]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [52]:
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [53]:
train = train.drop(['Cabin', 'Name', 'Ticket'],axis = 1)
train = pd.get_dummies(train)

In [54]:
train.head()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,22.0,1,0,7.2500,0,1,0,0,1
1,2,1,1,38.0,1,0,71.2833,1,0,1,0,0
2,3,1,3,26.0,0,0,7.9250,1,0,0,0,1
3,4,1,1,35.0,1,0,53.1000,1,0,0,0,1
4,5,0,3,35.0,0,0,8.0500,0,1,0,0,1

In [55]:
train

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,22.0,1,0,7.2500,0,1,0,0,1
1,2,1,1,38.0,1,0,71.2833,1,0,1,0,0
2,3,1,3,26.0,0,0,7.9250,1,0,0,0,1
3,4,1,1,35.0,1,0,53.1000,1,0,0,0,1
4,5,0,3,35.0,0,0,8.0500,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,27.0,0,0,13.0000,0,1,0,0,1
887,888,1,1,19.0,0,0,30.0000,1,0,0,0,1
888,889,0,3,NaN,1,2,23.4500,1,0,0,0,1
889,890,1,1,26.0,0,0,30.0000,0,1,1,0,0
890,891,0,3,32.0,0,0,7.7500,0,1,0,1,0

In [56]:
X = train.drop(['PassengerId','Survived'],axis = 1)

In [57]:
y = train.Survived

In [58]:
X.head()

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,3,22.0,1,0,7.2500,0,1,0,0,1
1,1,38.0,1,0,71.2833,1,0,1,0,0
2,3,26.0,0,0,7.9250,1,0,0,0,1
3,1,35.0,1,0,53.1000,1,0,0,0,1
4,3,35.0,0,0,8.0500,0,1,0,0,1

In [59]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [60]:
X.isna().sum()

Pclass          0
Age           177
SibSp           0
Parch           0
Fare            0
Sex_female      0
Sex_male        0
Embarked_C      0
Embarked_Q      0
Embarked_S      0
dtype: int64

In [61]:
X.Age = X.Age.fillna(X.Age.mean())

In [62]:
X.isna().sum()

Pclass        0
Age           0
SibSp         0
Parch         0
Fare          0
Sex_female    0
Sex_male      0
Embarked_C    0
Embarked_Q    0
Embarked_S    0
dtype: int64

In [63]:
X.shape

(891, 10)

In [64]:
y.shape

(891,)

In [158]:
clf = RandomForestClassifier()

In [159]:
par = {'max_depth' : range(1,20),'min_samples_leaf' : range(4,20),'min_samples_split' : range(4,20),'n_estimators' : range(1,20)}

In [160]:
searcher = GridSearchCV(clf,par,cv = 5,n_jobs = -1)

In [161]:
searcher.fit(X,y)

GridSearchCV(cv=5, estimator=RandomForestClassifier(), n_jobs=-1,
             param_grid={'max_depth': range(1, 20),
                         'min_samples_leaf': range(4, 20),
                         'min_samples_split': range(4, 20),
                         'n_estimators': range(1, 20)})

In [162]:
searcher.best_params_

{'max_depth': 14,
 'min_samples_leaf': 4,
 'min_samples_split': 9,
 'n_estimators': 15}

In [163]:
#clf = RandomForestClassifier(max_depth = 10, min_samples_leaf = 4, min_samples_split = 5)
clf = searcher.best_estimator_

In [164]:
searcher.score(X,y)

0.8843995510662177

In [165]:
ids = pd.read_csv('/Users/artemarhipov/Downloads/titanic/gender_submission.csv')
#predicted = pd.DataFrame(clf.predict(X_test))

In [166]:
ids

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [167]:
predicted = pd.DataFrame(index = ids.PassengerId,data = {'Survived':clf.predict(X_test)})

In [168]:
predicted

             Survived
PassengerId
892                 0
893                 0
894                 0
895                 0
896                 0
...               ...
1305                0
1306                1
1307                0
1308                0
1309                0

[418 rows x 1 columns]

In [169]:
predicted.isna().sum()

Survived    0
dtype: int64

In [170]:
predicted_csv = predicted.to_csv(path_or_buf='/Users/artemarhipov/Downloads/titanic5kaggle.csv')

In [171]:
#res = pd.read_csv('/Users/artemarhipov/Downloads/survived_test1_tit1.csv')

In [172]:
#predicted_csv = predicted.to_csv()

In [173]:
#pred1 = pd.DataFrame(predicted_csv)

In [174]:
y_test = pd.read_csv("/Users/artemarhipov/Downloads/titanic/gender_submission.csv")

In [175]:
y_test = y_test.Survived

In [176]:
accuracy_score(y_test,predicted.Survived)

0.8803827751196173